chulofiasco/BSDGames-AIX-PS-2-1.3/phantasia/phantasia.6
.TH PHANTASIA 6 "April 1, 2001"
.\"	$NetBSD: phantasia.6,v 1.11 2004/01/03 13:32:23 wiz Exp $
.\"
.SH NAME
phantasia \- an interterminal fantasy game
.SH SYNOPSIS
.B phantasia
[\fB\-abHmpSsx\fP]
.SH DESCRIPTION
.B phantasia
is a role playing game which allows players to roll up characters of
various types to fight monsters and other players.
Progression of characters is based upon gaining experience from fighting
monsters (and other players).
.PP
Most of the game is menu driven and self-explanatory (more or less).
The screen is cursor updated, so be sure to set up the
\fBTERM\fP
variable in your environment.
.PP
The options provide for a variety of functions to support the game.
They are:
.PP
.TP
\fB\-a\fP
Get a listing of all character names on file.
.TP
\fB\-b\fP
Show scoreboard of top characters per login.
.TP
\fB\-H\fP
Print header only.
.TP
\fB\-m\fP
Get a monster listing.
.TP
\fB\-p\fP
Purge old characters.
.TP
\fB\-S\fP
Turn on wizard options, if allowed, if running as
"root ."
.TP
\fB\-s\fP
Invokes
.B phantasia
without header information.
.TP
\fB\-x\fP
Examine/change a particular character on file.
.PP
.PP
The characters are saved on a common file, in order to make the game
interactive between players.
The characters are given a password in order to retrieve them later.
Only characters above
\fIlevel\fP
zero are saved.
Characters unused for awhile will be purged.
Characters are only placed on the scoreboard when they die.
.SH PARTICULARS
.SS Normal Play
A number of the player's more important statistics are almost always
displayed on the screen, with maximums (where applicable) in
parentheses.
.PP
The character is placed randomly near the center of a Cartesian
system.
Most commands are selected with a single letter or digit.
For example, one may move by hitting 'W', 'S', 'N', or 'E',
(lower case may also be used, at no time is the game case dependent).
One may also use 'H', 'J', 'K', 'L',
for movement, similar to
vi(1) .
To move to a specific (x, y) coordinate, use the
\fBmove\fP
('1') command.
The distance a character can move is calculated by
1 plus 1.5 per
\fIlevel .\fP
Moving in a compass direction will move the player the maximum
allowed distance in that direction.
.PP
A player may see who else is playing by using the
\fBplayers\fP
('2') option.
One may see the coordinates of those who are the same
distance or closer to the origin as he/she.
\fIKings ,\fP
and
\fIcouncil of the wise\fP
can see and can be seen by everyone.
A
\fIpalantir\fP
removes these restrictions.
.PP
One can talk to other players with the
\fBtalk\fP
('3') option.
In general, this is a line or so of text.
To remove a current
message, just type
<return>
when prompted for a message.
.PP
The
\fBstats\fP
('4') option shows additional characteristics of a player.
.PP
One may leave the game either with the
\fBquit\fP
('5') option.
.PP
One may rest by default.
Resting lets one regain maximum
\fIenergy level ,\fP
and also lets one find
\fImana\fP
(more is found for larger levels and further distances from the origin).
.PP
One may call a monster by hitting '9' or 'C'.
.PP
Use 'X' to examine other players.
.PP
One may quit or execute a sub-shell by hitting interrupt.
Quitting during battle results in death for obvious reasons.
.PP
Several other options become available as the player progresses in
\fIlevel\fP
and
\fImagic ,\fP
or to other stations in the game
\fI( valar ,\fP
\fIcouncil of the wise ,\fP
\fIking ) .\fP
These are described elsewhere.
In general, a control-L will force the redrawing of the screen.
.PP
Other things which may happen are more or less self-explanatory.
.SS Fighting Monsters
A player has several options while fighting monsters.
They are as follows:
.TP
\fBmelee\fP
Inflicts damage on the monster, based upon
\fIstrength .\fP
Also decreases the monster's
\fIstrength\fP
some.
.TP
\fBskirmish\fP
Inflicts a little less damage than
\fBmelee ,\fP
but decreases the monster's
\fIquickness\fP
instead.
.TP
\fBevade\fP
Attempt to run away.
Success is based upon both the player's and the monster's
\fIbrains\fP
and
\fIquickness .\fP
.TP
\fBspell\fP
Several options for throwing spells (described elsewhere).
.TP
\fBnick\fP
Hits the monster one plus the player's
\fIsword ,\fP
and gives the player 10% of the monster's
\fIexperience .\fP
Decreases the monster's
\fIexperience\fP
an amount proportional to the amount granted.
This also increases the monster's quickness.
Paralyzed monsters wake up very fast when nicked.
.TP
\fBluckout\fP
This is essentially a battle of wits with the monster.
Success is based upon the player's and the monster's
\fIbrains .\fP
The player gets credit for slaying the monster if he/she succeeds.
Otherwise, nothing happens, and the chance to
\fBluckout\fP
is lost.
.PP
.SS Character Statistics
.TP
\fIstrength\fP
determines how much damage a character can inflict.
.TP
\fIquickness\fP
determines how many chances a character gets to make decisions while fighting.
.TP
\fIenergy\fP level
specifies how much damage a character may endure before dying.
.TP
\fImagic\fP level
determines which spells a character may throw, and how effective those
spells will be.
.TP
\fIbrains\fP
basically, the character's intelligence; used for various fighting options
and spells.
.TP
\fImana\fP
used as a power source for throwing spells.
.TP
\fIexperience\fP
gained by fighting monsters and other characters.
.TP
\fIlevel\fP
indicative of how much experience a character has accumulated; progresses
geometrically as
\fIexperience\fP
increases.
.TP
\fIpoison\fP
sickness which degrades a character's performance (affects
\fIenergy level\fP
and
\fIstrength ) .\fP
.TP
\fIsin\fP
accumulated as a character does certain nasty things; used only rarely
in normal play of the game.
.TP
\fIage\fP
of player; roughly equivalent to number of turns.
As
\fIage\fP
increases, many personal statistics degenerate.
.PP
.SS Character Types
Character statistics are rolled randomly from the above list, according
to character type.
The types are as follows:
.TP
\fImagic\fP user
strong in
\fImagic level\fP
and
\fIbrains ,\fP
weak in other areas.
Must rely on wits and magic to survive.
.TP
\fIfighter\fP
good in
\fIstrength\fP
and
\fIenergy level ,\fP
fairly good in other areas.
This adds up to a well-equipped fighter.
.TP
\fIelf\fP
very high
\fIquickness\fP
and above average
\fImagic level\fP
are
\fIelves\fP
selling points.
.TP
\fIdwarf\fP
very high
\fIstrength\fP
and
\fIenergy level ,\fP
but with a tendency to be rather slow and not too bright.
.TP
\fIhalfling\fP
rather quick and smart, with high
\fIenergy level ,\fP
but poor in
\fImagic\fP
and
\fIstrength .\fP
Born with some
\fIexperience .\fP
.TP
\fIexperimento\fP
very mediocre in all areas.
However, the
\fIexperimento\fP
may be placed almost anywhere within the playing grid.
.PP
.PP
The possible ranges for starting statistics are summarized in
the following table.
.'"' mdoc: .TS 
l c c c c c c
l c c c c c c.
Type	Strength	Quick	Mana	Energy	Brains	Magic
_
Mag. User	10-15	30-35	50-100	30-45	60-85	5-9
Fighter	40-55	30-35	30-50	45-70	25-45	3-6
Elf	35-45	32-38	45-90	30-50	40-65	4-7
Dwarf	50-70	25-30	25-45	60-100	20-40	2-5
Halfling	20-25	34	25-45	55-90	40-75	1-4
Experimento	25	27	100	35	25	2
.'"' mdoc: .TE 
.\" .Bl -column "Experimento" "Strength" "Quick" "xxxxxx" "Energy" "Brains" "Magic"
.\" .It Sy Charactertype	Strength	Quick	Mana	Energy	Brains	Magic
.\" .It "Magic User"	10-15	30-35	50-100	30-45	60-85	5-9
.\" .It Fighter	40-55	30-35	30-50	45-70	25-45	3-6
.\" .It Elf	35-45	32-38	45-90	30-50	40-65	4-7
.\" .It Dwarf	50-70	25-30	25-45	60-100	20-40	2-5
.\" .It Halfling	20-25	34	25-45	55-90	40-75	1-4
.\" .It Experimento	25	27	100	35	25	2
.\" .El
.PP
Not only are the starting characteristics different for the different
character types, the characteristics progress at different rates for the
different types as the character goes up in
\fIlevel .\fP
\fIExperimentoes Ns '\fP
characteristics progress randomly as one of the other types.
The progression as characters increase in
\fIlevel\fP
is summarized in the following table.
.PP
.'"' mdoc: .TS 
nokeep ;
l c c c c c
l n n n n n.
Type	Strength	Mana	Energy	Brains	Magic
_
Mag. User	2.0	75	20	6	2.75
Fighter	3.0	40	30	3.0	1.5
Elf	2.5	65	25	4.0	2.0
Dwarf	5	30	35	2.5	1
Halfling	2.0	30	30	4.5	1
.'"' mdoc: .TE 
.PP
The character type also determines how much gold a player may
carry, how long until
\fIrings\fP
can overcome the player, and how much
\fIpoison\fP
the player can withstand.
.SS Spells
During the course of the game, the player may exercise his/her
magic powers.
These cases are described below.
.TP
\fBcloak\fP
\fImagic level necessary :\fP
20 (plus level 7)
.'"' mdoc: .br 
\fImana used :\fP
35 plus 3 per rest period
.'"' mdoc: .br 
Used during normal play.
Prevents monsters from finding the character,
as well as hiding the player from other players.
His/her coordinates show up as '?' in the
\fBplayers\fP
option.
Players cannot collect
\fImana ,\fP
find trading posts, or discover the
\fIgrail\fP
while cloaked.
Calling a monster uncloaks, as well as choosing this option while cloaked.
.TP
\fBteleport\fP
\fImagic level necessary :\fP
40 (plus level 12)
.'"' mdoc: .br 
\fImana used :\fP
30 per 75 moved
.'"' mdoc: .br 
Used during normal play.
Allows the player to move with much more freedom than with the
\fBmove\fP
option, at the price of expending mana.
The maximum distance possible to move is based upon
\fIlevel\fP
and
\fImagic level .\fP
.TP
\fBpower\fP blast
\fImagic level necessary :\fP
none
.'"' mdoc: .br 
\fImana used :\fP
5 times
\fIlevel\fP
.'"' mdoc: .br 
Used during inter-terminal battle.
Damage is based upon
\fImagic level\fP
and
\fIstrength .\fP
Hits much harder than a normal hit.
.TP
\fBall\fP or nothing
\fImagic level necessary :\fP
none
.'"' mdoc: .br 
\fImana used :\fP
1
.'"' mdoc: .br 
Used while combating monsters.
Has a 25% chance of working.
If it works it hits the monster just enough to kill it.
If it fails, it doesn't hit the monster, and doubles the monster's
\fIquickness\fP
and
\fIstrength .\fP
Paralyzed monsters wake up much quicker as a result of this spell.
.TP
\fBmagic\fP bolt
\fImagic level necessary :\fP
5
.'"' mdoc: .br 
\fImana used :\fP
variable
.'"' mdoc: .br 
Used while combating monsters.
Hits the monster based upon the amount
of
\fImana\fP
expended and
\fImagic level .\fP
Guaranteed to hit at least 10 per
\fImana .\fP
.TP
\fBforce\fP field
\fImagic level necessary :\fP
15
.'"' mdoc: .br 
\fImana used :\fP
30
.'"' mdoc: .br 
Used during monster combat.
Throws up a shield to protect from damage.
The shield is added to actual energy level, and is a fixed number, based
upon maximum energy.
Normally, damage occurs first to the shield, and then to the players actual
\fIenergy level .\fP
.TP
\fBtransform\fP
\fImagic level necessary :\fP
25
.'"' mdoc: .br 
\fImana used :\fP
50
.'"' mdoc: .br 
Used during monster combat.
Transforms the monster randomly into one of the 100 monsters from
the monster file.
.TP
\fBincrease\fP might
\fImagic level necessary :\fP
35
.'"' mdoc: .br 
\fImana used :\fP
75
.'"' mdoc: .br 
Used during combat with monsters.
Increases strength up to a maximum.
.TP
\fBinvisibility\fP
\fImagic level necessary :\fP
45
.'"' mdoc: .br 
\fImana used :\fP
90
.'"' mdoc: .br 
Used while fighting monsters.
Makes it harder for the monster to hit, by temporarily increasing the player's
\fIquickness .\fP
This spell may be thrown several times, but a maximum level will be reached.
.TP
\fBtransport\fP
\fImagic level necessary :\fP
60
.'"' mdoc: .br 
\fImana used :\fP
125
.'"' mdoc: .br 
Used during monster combat.
Transports the monster away from the player.
Success is based upon player's
\fImagic\fP
and
\fIbrains ,\fP
and the monster's
\fIexperience .\fP
If it fails the player is transported instead.
60% of the time, the monster will drop any treasure it was carrying.
.TP
\fBparalyze\fP
\fImagic level necessary :\fP
75
.'"' mdoc: .br 
\fImana used :\fP
150
.'"' mdoc: .br 
Used during monster combat.
"Freezes"
the monster by putting its
\fIquickness\fP
slightly negative.
The monster will slowly wake up.
Success is based upon player's
\fImagic\fP
and the monster's
\fIexperience .\fP
If it fails, nothing happens.
.TP
\fBspecify\fP
\fImagic level necessary :\fP
none
.'"' mdoc: .br 
\fImana used :\fP
1000
.'"' mdoc: .br 
Used during monster combat only by
\fIvalar\fP
or
\fIcouncil of the wise .\fP
Allows the player to pick which monster to fight.
.PP
.SS Monsters
Monsters get bigger as one moves farther from the origin (0,0).
Rings of distance 125 from the origin determine the size.
A monster's
\fIexperience ,\fP
\fIenergy level ,\fP
and
\fIbrains\fP
are multiplied by the size.
\fIStrength\fP
is increased 50% per size over one, and
\fIquickness\fP
remains the same, regardless of size.
.PP
Also, nastier monsters are found as one progress farther out from the origin.
Monsters also may flock.
The percent chance of that happening is designated as
\fIflock%\fP
in the monster listing.
Monsters outside the first ring
may carry treasure, as determined by their treasure type.
Flocking monsters, and bigger monsters increase the chances of treasure.
.PP
Certain monsters have special abilities; they are as follows:
.TP
\fIUnicorn\fP
can only be subdued if the player is in possession of a
\fIvirgin .\fP
.TP
\fIModnar\fP
has random characteristics, including treasure type.
.TP
\fIMimic\fP
will pick another name from the list of monsters in order to confuse.
.TP
\fIDark\fP Lord
very nasty person.
Does not like to be hit (especially nicked),
and many spells do not work well (or at all) against him.
One can always
\fIevade\fP
from the
\fIDark Lord .\fP
.TP
\fILeanan-Sidhe\fP
also a very nasty person.
She will permanently sap
\fIstrength\fP
from someone.
.TP
\fISaruman\fP
wanders around with
\fIWormtongue ,\fP
who can steal a
\fIpalantir .\fP
Also,
\fISaruman\fP
may turn a player's gems into gold pieces, or scramble her/his stats.
.TP
\fIThaumaturgist\fP
can transport a player.
.TP
\fIBalrog\fP
inflicts damage by taking away
\fIexperience ,\fP
not
\fIenergy .\fP
.TP
\fIVortex\fP
may take some
\fImana .\fP
.TP
\fINazgul\fP
may try to steal a
\fIring\fP
or neutralize part of one's
\fIbrains .\fP
.TP
\fITiamat\fP
may take half a player's
\fIgold\fP
and
\fIgems\fP
and escape.
.TP
\fIKobold\fP
may get nasty and steal one gold piece and run away.
.TP
\fIShelob\fP
may bite, inflicting the equivalent of one
\fIpoison .\fP
.TP
\fIAssorted\fP Faeries
These are killed if attacking someone carrying
\fIholy water .\fP
These are
\fICluricaun , Fir Darrig , Fachan ,\fP
\fIGhille Dhu , Bogle , Killmoulis ,\fP
and
\fIBwca .\fP
.TP
\fILamprey\fP
may bite, inflicting 1/2 of a
\fIpoison .\fP
.TP
\fIShrieker\fP
will call one of its (much bigger) buddies if picked upon.
.TP
\fIBonnacon\fP
will become bored with battle, fart, and run off.
.TP
\fISmeagol\fP
will try to steal a
\fIring\fP
from a player, if given the chance.
.TP
\fISuccubus\fP
may inflict damage through a
\fBforce field .\fP
This subtracts from
\fIenergy level\fP
instead of any shield the player may have thrown up.
This is a very easy way to die.
.TP
\fICerberus\fP
loves metal and will steal all the metal treasures from a player if able.
.TP
\fIUngoliant\fP
can bite and poison.
This inflicts five
\fIpoisons ,\fP
and also takes one from the player's
\fIquickness .\fP
.TP
\fIJabberwock\fP
may tire of battle, and leave after calling one of his friends
\fI( Jubjub Bird\fP
or
\fIBandersnatch ) .\fP
.TP
\fIMorgoth\fP
actually
\fIModnar ,\fP
but reserved for
\fIcouncil of the wise , valar ,\fP
and
\fIex-valar .\fP
Fights with
\fIMorgoth\fP
end when either he or the player dies.
His characteristics are calculated based upon the player's.
The player is given the chance to ally with him.
No magic, except
\fBforce field\fP
works when battling
\fIMorgoth .\fP
.TP
\fITroll\fP
may regenerate its
\fIenergy\fP
and
\fIstrength\fP
while in battle.
.TP
\fIWraith\fP
may make a player blind.
.PP
.SS Treasures
The various treasure types are as follows:
.TP
Type zero
none
.TP
Type one
\fIpower booster\fP
\- adds mana.
.'"' mdoc: .br 
\fIdruid\fP
\- adds experience.
.'"' mdoc: .br 
\fIholy orb\fP
\- subtracts 0.25 sin.
.'"' mdoc: .TP 1.5i
1.5i
.TP
Type two
\fIamulet\fP
\- protects from cursed treasure.
.'"' mdoc: .br 
\fIholy water\fP
\- kills
\fIassorted faeries .\fP
.'"' mdoc: .br 
\fIhermit\fP
\- reduces sin by 25% and adds some mana.
.TP
Type three
\fIshield\fP
\- adds to maximum
\fIenergy level .\fP
.'"' mdoc: .br 
\fIvirgin\fP
\- used to subdue a
\fIunicorn ,\fP
or to give much
\fIexperience\fP
(and some
\fIsin ) .\fP
.'"' mdoc: .br 
\fIathelas\fP
\- subtracts one
\fIpoison .\fP
.TP
Type four (scrolls)
\fIshield\fP
\- throws a bigger than normal
\fBforce field .\fP
.'"' mdoc: .br 
\fIinvisible\fP
\- temporarily puts the finder's
\fIquickness\fP
to one million.
.'"' mdoc: .br 
\fIten fold strength\fP
\- multiplies finder's strength by ten.
.'"' mdoc: .br 
\fIpick monster\fP
\- allows finder to pick next monster to battle.
.'"' mdoc: .br 
\fIgeneral knowledge\fP
\- adds to finder's
\fIbrains\fP
and
\fImagic level .\fP
.PP
All the scrolls except
\fIgeneral knowledge\fP
automatically call a monster.
These preserve any spells that were already in effect, but are only in
effect while in battle.
.TP
Type five
\fIdagger\fP
\- adds to
\fIstrength .\fP
.'"' mdoc: .br 
\fIarmour\fP
\- same as a
\fIshield ,\fP
but bigger.
.'"' mdoc: .br 
\fItablet\fP
\- adds
\fIbrains .\fP
.TP
Type six
\fIpriest\fP
\- rests to maximum; adds
\fImana , brains ;\fP
and halves
\fIsin .\fP
.'"' mdoc: .br 
\fIRobin Hood\fP
\- increases
\fIshield\fP
and adds permanently to
\fIstrength .\fP
.'"' mdoc: .br 
\fIaxe\fP
\- like
\fIdagger ,\fP
but bigger.
.TP
Type seven
\fIcharm\fP
\- protects from cursed treasure (used before
\fIamulet ) ;\fP
used in conjunction with
\fIblessing\fP
to battle
\fIDark Lord .\fP
.'"' mdoc: .br 
\fIMerlyn\fP
\- adds
\fIbrains , magic ,\fP
and
\fImana .\fP
.'"' mdoc: .br 
\fIwar hammer\fP
\- like an
\fIaxe ,\fP
but bigger.
.TP
Type eight
\fIhealing potion\fP
\- sets
\fIpoison\fP
to -2, or subtracts two from
\fIpoison ,\fP
whichever is better.
.'"' mdoc: .br 
\fItransporter\fP
\- allows finder to move anywhere.
.'"' mdoc: .br 
\fIsword\fP
\- like a
\fIwar hammer ,\fP
but bigger.
.TP
Type nine
\fIgolden crown\fP
\- allows the player to become
\fIking ,\fP
by going to (0,0).
.'"' mdoc: .br 
\fIblessing\fP
\- cuts
\fIsin\fP
to 1/3, adds
\fImana ,\fP
rests to maximum, kills
\fIDark Lord\fP
with a
\fIcharm ,\fP
and gives bearer first hit on all monsters.
.'"' mdoc: .br 
\fIquicksilver\fP
\- adds to
\fIquickness .\fP
.TP
Type ten
\fIelven boots\fP
\- adds permanently to
\fIquickness .\fP
.TP
Type eleven
\fIpalantir\fP
\- allows one to see all the other players; used by
\fIcouncil of the wise\fP
to seek the
\fIgrail .\fP
.TP
Type twelve/thirteen
\fIring\fP
\- allows one to hit much harder in battle, etc.
.PP
.PP
Any treasure type 10-13 monsters may instead carry a type nine treasure.
.PP
A monster may also be carrying
\fIgold\fP
or
\fIgems .\fP
These are used at
\fItrading posts\fP
to buy things.
A
\fIgem\fP
is worth 1000 gold pieces.
Too much
\fIgold\fP
will slow a player down.
One may carry 1000 plus 200 per
\fIlevel\fP
of
\fIgold .\fP
A
\fIgem\fP
weighs one half a gold piece.
Monsters of treasure type 7 or higher may carry
\fIgems .\fP
.PP
The chance of a cursed treasure is based upon treasure type.
The more valuable treasures have a greater chance of being cursed.
A cursed treasure knocks
\fIenergy level\fP
very low, and adds 0.25
\fIpoison .\fP
.SS Rings
\fIRings\fP
are only carried by
\fInazguls\fP
and
\fIDark Lords .\fP
They come in four different flavors.
All
\fIrings\fP
rest the player to maximum and cause him/her to hit much harder
in battle with monsters (assuming one has chosen to use the
\fIring\fP
for battle.)
.PP
Two types of
\fIrings\fP
are cursed and come either from
\fInazguls\fP
or
\fIDark Lord .\fP
After a few times of using these types, the player falls
under the control of the
\fIring ,\fP
and strange, random things will occur.
Eventually, the player dies, and gives his/her name to a monster
on the file.
Dying before the
\fIring\fP
is used up also renames the monster.
.PP
The two remaining types of
\fIrings\fP
are much more benign.
The one from a
\fInazgul\fP
is good for a limited number of battle rounds, and will save
the player from death if it was being used when he/she died.
The one from
\fIDark Lord\fP
is the same, except that it never is used up.
\fIrings\fP
disappear after saving someone from death.
In general, cursed
\fIrings\fP
occur much more often than normal ones.
It is usually not a good idea to pick one up.
The only way to get rid of a
\fIring\fP
is to have a monster steal it.
.SS King
A player may become
\fIking\fP
by finding a
\fIcrown\fP
and going to (0,0).
Players must have a
\fIlevel\fP
in the range of 10 to 1000 to be able to find a
\fIcrown .\fP
When a player with one or more
\fIcrowns\fP
reaches
\fIlevel\fP
1000, the
\fIcrowns\fP
are converted to
\fIgold .\fP
.PP
Once a player is king, he/she may do certain things while in
the Lord's Chamber (0,0).
These are exercised with the
\fBdecree\fP
('0') option.
.TP
\fBtransport\fP
This is done to another player.
It randomly moves the affected player about.
A
\fIcharm\fP
protects from transports.
.TP
\fBcurse\fP
This is done to another player.
It is analogous to cursed treasure, but worse.
It inflicts two
\fIpoison ,\fP
knocks
\fIenergy level\fP
very low, and degrades the maximum energy.
It also removes a
\fIcloak .\fP
A
\fIblessing\fP
protects from king's curses.
.TP
\fBenergy\fP void
The king may put a number of these scattered about
his/her kingdom as he/she pleases.
If a player hits one, he/she loses
\fImana , energy ,\fP
and
\fIgold .\fP
The energy void disappears after being hit.
.TP
\fBbestow\fP
This is also done to another player.
The king may wish to reward one or more loyal subjects by sharing his/her
riches
\fI( gold ) .\fP
Or it is a convenient way to dispose of some unwanted deadweight.
.TP
\fBcollect\fP taxes
Everyone pays 7% tax on all
\fIgold\fP
and
\fIgems\fP
acquired, regardless of the existence of a
\fIking .\fP
The king collects the accrued taxes with this option.
.PP
.PP
The
\fIking\fP
may also
\fBteleport\fP
anywhere for free by using the origin as a starting place.
.SS Council of the Wise, Valar
A player automatically becomes a member of the
\fIcouncil of the wise\fP
upon reaching level 3000.
Members of the council cannot have
\fIrings .\fP
Members of the council have a few extra options which they can exercise.
These are exercised with the
\fBintervene\fP
('8') option.
All
\fBintervene\fP
options cost 1000 mana.
One
\fBintervene\fP
option is to
\fBheal\fP
another player.
This is just a quick way for that player to be rested
to maximum and lose a little
\fIpoison .\fP
The main purpose in life for members of the council is to seek the
\fIHoly Grail .\fP
This is done with a
\fIpalantir\fP
under the
\fBseek grail\fP
option.
The distance cited by the seek is accurate within 10%, in order
not to make it too easy to find the grail.
A player must have infinitesimally small
\fIsin ,\fP
or else it's all over upon finding the grail.
In order to help members of the council on their quest, they
may
\fBteleport\fP
with greater ease.
.PP
Upon finding the grail, the player advances to position of
\fIvalar .\fP
He/she may then exercise more and niftier options under
\fBintervention .\fP
These include all of the council members' options plus the
ability to move other players about, bless them, and throw monsters at
them.
A
\fIvalar Ns 's\fP
blessing has the same effect as the treasure
\fIblessing ,\fP
except that the affected player does not get his/her
\fIblessing\fP
flag set.
All
\fBintervention\fP
options which affect other players age the player who uses them.
\fIValars\fP
are essentially immortal, but are actually given five lives.
If these are used up, the player is left to die, and becomes an
\fIex-valar .\fP
A
\fIvalar\fP
cannot
\fBmove , teleport ,\fP
or call monsters.
(An exception to this is if the
\fIvalar\fP
finds a
\fItransporter . )\fP
This is to allow him/her to dispose of excess
\fIgold .\fP
Any monsters which a
\fIvalar\fP
encounters are based upon his/her size.
Only one valar may exist at a time.
The current valar is replaced when another player finds the grail.
The valar is then bumped back to the council of the wise.
.SS Wizard
The
\fIwizard\fP
is usually the owner of the game, and the one who maintains
the associated files.
The
\fIwizard\fP
is granted special powers within the game, if it is invoked
with the
\fB\-S\fP
option.
Otherwise, the
\fIwizard\fP
plays no different from other players.
The
\fIwizard\fP
abilities are outlined below.
.TP
\fBchange\fP players
When examining a player, (game invoked with
\fB\-x ,\fP
or use 'X' from within game), the
\fIwizard\fP
may also change the player.
.TP
\fBintervention\fP
The
\fIwizard\fP
may do all the
\fBintervention\fP
options.
One extra option,
\fBvaporize ,\fP
is added to kill any offensive players.
.TP
\fBsuper\fP character type
An extra character type is added.
This character starts with the
maximum possible in all statistics, selected from the other character types.
A
\fIsuper\fP
character's statistics also progress at the maximum possible rate, selected
from the other character types.
.PP
.SS Special Places
Certain regions of the playing grid have different names.
In general, this is only to give the player some idea of
his/her present location.
Some special places do exist.
.TP
\fITrading\fP Posts
These are located at |x| == |y| == n*n*100 for n = 1, 2, ..., 1000.
Trading posts farther out have more things for sale.
Be careful about cheating the merchants there, as they have short tempers.
Merchants are dishonest about 5% of the time.
.TP
\fILord's\fP Chamber
This is located at (0,0).
Only players with
\fIcrowns\fP
may enter.
.TP
\fIPoint\fP of \&No Return
This is located beyond 1.2e+6 in any direction.
The only way to return from here is a
\fItransporter\fP
or to have a
\fIvalar\fP
relocate the player.
.TP
\fIDead\fP Marshes
This is a band located fairly distant from the origin.
The first fourteen monsters (water monsters) can normally only be found here.
.TP
\fIValhala\fP
This place is where the
\fIvalar\fP
resides.
It is associated with no particular coordinate on the playing grid.
.PP
.SS Miscellaneous
Once a player reaches
\fIlevel\fP
5, the game will start to time out waiting for input.
This is to try to keep the game a bit faster paced.
.PP
A
\fIguru\fP
will never be disgusted with your
\fIsins\fP
if they are less than one.
.PP
A
\fImedic\fP
wants half of a player's
\fIgold\fP
to be happy.
Offering more than one has, or a negative amount will anger the
\fImedic ,\fP
who will make the player worse (add one
\fIpoison ) .\fP
.PP
The
\fIHoly Grail\fP
does little for those who are not ready to behold it.
Whenever anyone finds it, it moves.
It is always located within 1e+6 in any compass direction of the origin.
.PP
There is a maximum amount of
\fImana\fP
and
\fIcharms\fP
a player may posses, based upon
\fIlevel .\fP
\fIQuicksilver\fP
is always limited to to a maximum of 99.
.PP
\fIBooks\fP
bought at a
\fItrading post\fP
increase
\fIbrains ,\fP
based upon the number bought.
It is unwise, however to buy more than 1/10 of one's
\fIlevel\fP
in books at a time.
.PP
Players over level 10000 are automatically retired.
.PP
A
\fIblindness\fP
goes away in random time.
.PP
Players with
\fIcrowns\fP
are identified with a '*' before their character type.
.SS Inter-terminal Battle
When two player's coordinates correspond, they may engage in battle.
In general, the player with the highest
\fIquickness\fP
gets the first hit.
If the two players are severely mismatched, the stronger player
is drastically handicapped for the battle.
In order to protect from being stuck in an infinite loop,
the player waiting for response may time out.
Options for battle are:
.TP
\fBfight\fP
Inflicts damage upon other person.
.TP
\fBrun\fP away
Escape from battle.
Has a 75% chance of working.
.TP
\fBpower\fP blast
Battle spell.
.TP
\fBluckout\fP
One-time chance to try to win against the foe.
Has a 10% chance of working.
.PP
.PP
Sometimes waits for the other player may be excessive, because
he/she may be battling a monster.
Upon slaying a player in battle the winner gets the other's
\fIexperience\fP
and treasures.
\fIRings\fP
do not work for inter-terminal battle.
.SH AUTHORS
Edward Estes ,
AT\*[Am]T Information Systems, Skokie, IL
.SH BUGS
All screen formats assume at least 24 lines by at least 80 columns.
No provisions are made for when any of the data items get too big
for the allotted space on the screen.

