chulofiasco/BSDGames-AIX-PS-2-1.3/countmail/countmail.6
.TH COUNTMAIL 6 "October 3, 1997"
.\"	$NetBSD: countmail.6,v 1.10 2004/02/08 00:31:16 jsm Exp $
.\"
.\" Copyright (c) 1997 Matthew R. Green
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.SH NAME
countmail \- be obnoxious about how much mail you have
.SH SYNOPSIS
.B countmail
.SH DESCRIPTION
The
.B countmail
program counts your mail and tells you about it rather obnoxiously.
.SH HISTORY
The
.B countmail
program first appeared in
NetBSD 1.3 .
.B countmail
was first written by
Noah Friedman Aq friedman@splode.com
in 1993.
This version was written by Charles M. Hannum
<mycroft@NetBSD.org .>
.SH CAVEATS
The read loop is horrendously slow on every shell implementation tried.
.B countmail
uses
from(1)
and
wc(1)
instead, though these are not shell builtins.
.SH SEE ALSO
from(1)

