chulofiasco/BSDGames-AIX-PS-2-1.3/fortune/strfile/strfile.8
.TH STRFILE 8 "June 9, 1993"
.\"	$NetBSD: strfile.8,v 1.12 2004/09/09 22:03:21 wiz Exp $
.\"
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Ken Arnold.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)strfile.8	8.1 (Berkeley) 6/9/93
.\"
.SH NAME
strfile, unstr \- "create a random access file for storing strings"
.SH SYNOPSIS
.B strfile
[\fB\-iorsx\fP]
[\fB\-c\fP \fIchar\fP]
\fIsource_file\fP
[\fIoutput_file\fP]
.br
.B unstr
\fIsource_file\fP
.SH DESCRIPTION
.B strfile
reads a file containing groups of lines separated by a line containing
a single percent
.'"' mdoc: .Ql \&%
\&%
sign and creates a data file which contains
a header structure and a table of file offsets for each group of lines.
This allows random access of the strings.
.PP
The output file, if not specified on the command line, is named
\fIsource_file Ns Sy .out .\fP
.PP
The options are as follows:
.TP
\fB\-c\fP \fIchar\fP
Change the delimiting character from the percent sign to
\fIchar .\fP
.TP
\fB\-i\fP
Ignore case when ordering the strings.
.TP
\fB\-o\fP
Order the strings in alphabetical order.
The offset table will be sorted in the alphabetical order of the
groups of lines referenced.
Any initial non-alphanumeric characters are ignored.
This option causes the
.'"' mdoc: .Dv STR_ORDERED
STR_ORDERED
bit in the header
\fIstr_flags\fP
field to be set.
.TP
\fB\-r\fP
Randomize access to the strings.
Entries in the offset table will be randomly ordered.
This option causes the
.'"' mdoc: .Dv STR_RANDOM
STR_RANDOM
bit in the header
\fIstr_flags\fP
field to be set.
.TP
\fB\-s\fP
Run silently; don't give a summary message when finished.
.TP
\fB\-x\fP
Note that each alphabetic character in the groups of lines is rotated
13 positions in a simple caesar cipher.
This option causes the
.'"' mdoc: .Dv STR_ROTATED
STR_ROTATED
bit in the header
\fIstr_flags\fP
field to be set.
.PP
.PP
The format of the header is:
.nf
#define	VERSION	1
unsigned long	str_version;	/* version number */
unsigned long	str_numstr;	/* # of strings in the file */
unsigned long	str_longlen;	/* length of longest string */
unsigned long	str_shortlen;	/* length of shortest string */
#define	STR_RANDOM	0x1	/* randomized pointers */
#define	STR_ORDERED	0x2	/* ordered pointers */
#define	STR_ROTATED	0x4	/* rot-13'd text */
unsigned long	str_flags;	/* bit field for flags */
char str_delim;			/* delimiting character */
.fi
.PP
All fields are written in big-endian byte order.
.PP
The purpose of
.B u
is to undo the work of
.B strfile
It prints out the strings contained in the file
\fIsource_file\fP
in the order that they are listed in the header file
\fIsource_file Ns Sy .dat\fP
to standard output.
It is possible to create sorted versions of input files by using
\fB\-o\fP
when
.B s
is run and then using
.B u
to dump them out in the table order.
.SH FILES
.TP
\fIstrfile.out\fP
default output file.
.PP
.SH SEE ALSO
byteorder(3) ,
fortune(6)
.SH HISTORY
The
.B s
utility first appeared in
.'"' mdoc: .Bx 4.4 .
4.4 .

